In [1]:
#Q1
# Collection datatypes in Python are built-in sequence data types.
# Some basic python data structures are(int, str, list, dict, etc.) 
# int function -> converst value into an integer number
# str function -> sequences unit code
# list function -> used to store multiple items in a single variable
# dict function -> unordered collection of data

In [4]:
#Q2
import pandas as pd
emp_df= {"name" : ['Nancy','Andrew','Janet','Margaret','Steven'],
         'monthly_salary': [5000,4000,6000,3000,2000], 
         'zip' : [98122,98401,98033,98052,98051]}

In [15]:
emp_df

{'name': ['Nancy', 'Andrew', 'Janet', 'Margaret', 'Steven'],
 'monthly_salary': [5000, 4000, 6000, 3000, 2000],
 'zip': [98122, 98401, 98033, 98052, 98051]}

In [48]:
df1=pd.DataFrame(emp_df)

In [49]:
print(df1)

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

In [50]:
df1

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

In [51]:
#Q3
print(df1.loc[0:0])

    name  monthly_salary    zip
0  Nancy            5000  98122

In [52]:
df1.loc[0:0]

    name  monthly_salary    zip
0  Nancy            5000  98122

In [31]:
#Q4
print(df1.loc[4:4])

     name  monthly_salary    zip
4  Steven            2000  98051

In [36]:
df1.loc[4:4]

     name  monthly_salary    zip
4  Steven            2000  98051

In [39]:
#Q5
print('The shape is:', df1.shape)

The shape is: (5, 3)

In [38]:
print('The size is:', df1.size)

The size is: 15

In [45]:
#Q6
print(df1['monthly_salary'].mean())

4000.0

In [60]:
#Q7
df1.sort_values('name',ascending=0)

       name  monthly_salary    zip
4    Steven            2000  98051
0     Nancy            5000  98122
3  Margaret            3000  98052
2     Janet            6000  98033
1    Andrew            4000  98401

In [73]:
#Q8
df1.query("zip==98033")

    name  monthly_salary    zip
2  Janet            6000  98033

In [77]:
#9
df1["annual_salary"]=df1["monthly_salary"]*12
df1

       name  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [78]:
#10
df1.rename(columns={'name':'firstname'})

  firstname  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [89]:
#Q11
emp_info={'firstname' :['Nancy','Andrew','Janet','Margaret','Steven'],'annual_salary':[60000,48000,72000,36000,24000
],'zip': [98122, 98401, 98033, 98052, 98051] }
print(emp_info)

{'firstname': ['Nancy', 'Andrew', 'Janet', 'Margaret', 'Steven'], 'annual_salary': [60000, 48000, 72000, 36000, 24000], 'zip': [98122, 98401, 98033, 98052, 98051]}

In [90]:
df2=pd.DataFrame(emp_info)

In [91]:
df2

  firstname  annual_salary    zip
0     Nancy          60000  98122
1    Andrew          48000  98401
2     Janet          72000  98033
3  Margaret          36000  98052
4    Steven          24000  98051

In [92]:
#Q12
df2['firstname'].head()

0       Nancy
1      Andrew
2       Janet
3    Margaret
4      Steven
Name: firstname, dtype: object

In [93]:
#13
df2.drop('annual_salary', axis = 1)

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margaret  98052
4    Steven  98051